var myButton = document.querySelector('button');
var myHeading = document.querySelector('h1');

function setUserName() {
	var myName = prompt('Please eneter your name.');
	localStorage.setItem('name', myName);
	myHeading.textContent = 'n̈́͊̇͒̊̏ͫͩ̄͛͗̓̀͏͙̭̫̟͖̥̦̠̜̮͢͡ͅḭ̷̩͈̗͍͍̗̰̣̙̭̭̼̯͗̀͌ͯ̂̈́̅̀͠k̸̜̗͔̳̘̗̰̗̙̖̩͇̫̩̫ͦͮ̆͗̊̀͊̈͆ͪ̇͌ͦ̋̋̀̕k̴̺̮̦̘̯̭̩̰̫̜̙̼̬̿̀̐̾͂ͪ̏ͩ͋͐ͧ̽̈́͒̉ͨ̊̒̚͘͜͞ă̴̤̱͇̯̖̞̗̠̤͓̹̤̬̩͖̊ͤ͑ͬ̚͟͟͝n̖̪̣͚̗̥̠̯ͬ̀͑̋̍͐ͣ͊̐͞͠ȃ̙̹̮̩̹͈̣̦ͧ̏̽̓̒̏̅ͮ͂͛͘͘͟ķ̹̣̞͚̪͌̊̓͂͒̿̍͂ͭͨ͑ͪ͌̌̃̑̽ͮ͑̀́n̵̩̪̩̩̠͉͇̳ͣ͋ͪ͆̂ͫ͒̅͆̎̏̌͘͞i̷̧̻̠̺͎̟̻̹̖̜͈͎̮͓͚̘͓̲͖̣͛̓͊ͥ̓͊̈́̓ͪ͛ͫ̏̿ͫ̚͢͢͢q̷ͫ̉ͨ͐ͬ̓̐͗́҉̵͇̼̟̟͟q̡̖̣̠͇̙̥̠̮̲̥̯͉͉̘̱̗̇̒̽̂̇̔ͯ̓ͭ̏̍̓͢͠ͅȁ̶̧̞̗̞̝̱̹͈̼̲̘̠̼̜̫̬͈͔̞͖ͪ͆͌ͬͭ͒ͯͦ̍͊́ͭͣ̽ͯ͑̽͝͝͞n̢̛̼͙̹̯̬̝̺̙̥̯͚̣͙̰̯̍̍̏̅̊̃͜͝i̷̢̧̼̰̖ͪͣ̏͌̑͛̂ͨͯ̓̈̍̚̚͢kͧ̆̇͆̀͢͟͏̜͎͍͇̫̲̭͉̪̗̠̦̦̞̣̪̰̪́ņ̵̴̠̟͇̫̼̙̘̰̦̣̲̘͍̉ͥͭͤ͂̊́ȉ̢̡̛͖̖̗̹͌ͣͬͪ̇̿̄ͭ̚͝ṇ̡̙̤̙̙ͣ́ͤ̌ͪ̀͞͞k̛̗̜̱̜͎̖̜̝͓̙͕̩̳͈̝̞̞̟̾̇̓̏͐̓̾̓ͦͬ͆͒̃ͫ̌͛̃͝ͅn̖̜͈͖̞̼͎͍̦͌̋ͯͫ̀̓ͪ̋̅͗̑̾̔ͧ͟͞i̡̨̬̫͇̪̯̯̍̓͒̑ͨ̎͛ͯͣ́͠ḯ̂̊ͫ͗͂ͤ̓̎ͣ͋̊̇̒҉̨̰͇̖̦̕͝͝i̎̿̂̅͒̈́̈̓̀ͤ͑̽ͫ̏͏͓̺̠͕͈̀͟k̷̢͕̣͓̼͔͍̭̭̙̺̰̰̦͈͍̥̩̎̀̍̓̉̽͗͐͗ͦ̊̃̍̀̚͘͘, ' + myName;
}

if(!localStorage.getItem('name')) {
  setUserName();
} else {
  var storedName = localStorage.getItem('name');
  myHeading.textContent = 'n̈́͊̇͒̊̏ͫͩ̄͛͗̓̀͏͙̭̫̟͖̥̦̠̜̮͢͡ͅḭ̷̩͈̗͍͍̗̰̣̙̭̭̼̯͗̀͌ͯ̂̈́̅̀͠k̸̜̗͔̳̘̗̰̗̙̖̩͇̫̩̫ͦͮ̆͗̊̀͊̈͆ͪ̇͌ͦ̋̋̀̕k̴̺̮̦̘̯̭̩̰̫̜̙̼̬̿̀̐̾͂ͪ̏ͩ͋͐ͧ̽̈́͒̉ͨ̊̒̚͘͜͞ă̴̤̱͇̯̖̞̗̠̤͓̹̤̬̩͖̊ͤ͑ͬ̚͟͟͝n̖̪̣͚̗̥̠̯ͬ̀͑̋̍͐ͣ͊̐͞͠ȃ̙̹̮̩̹͈̣̦ͧ̏̽̓̒̏̅ͮ͂͛͘͘͟ķ̹̣̞͚̪͌̊̓͂͒̿̍͂ͭͨ͑ͪ͌̌̃̑̽ͮ͑̀́n̵̩̪̩̩̠͉͇̳ͣ͋ͪ͆̂ͫ͒̅͆̎̏̌͘͞i̷̧̻̠̺͎̟̻̹̖̜͈͎̮͓͚̘͓̲͖̣͛̓͊ͥ̓͊̈́̓ͪ͛ͫ̏̿ͫ̚͢͢͢q̷ͫ̉ͨ͐ͬ̓̐͗́҉̵͇̼̟̟͟q̡̖̣̠͇̙̥̠̮̲̥̯͉͉̘̱̗̇̒̽̂̇̔ͯ̓ͭ̏̍̓͢͠ͅȁ̶̧̞̗̞̝̱̹͈̼̲̘̠̼̜̫̬͈͔̞͖ͪ͆͌ͬͭ͒ͯͦ̍͊́ͭͣ̽ͯ͑̽͝͝͞n̢̛̼͙̹̯̬̝̺̙̥̯͚̣͙̰̯̍̍̏̅̊̃͜͝i̷̢̧̼̰̖ͪͣ̏͌̑͛̂ͨͯ̓̈̍̚̚͢kͧ̆̇͆̀͢͟͏̜͎͍͇̫̲̭͉̪̗̠̦̦̞̣̪̰̪́ņ̵̴̠̟͇̫̼̙̘̰̦̣̲̘͍̉ͥͭͤ͂̊́ȉ̢̡̛͖̖̗̹͌ͣͬͪ̇̿̄ͭ̚͝ṇ̡̙̤̙̙ͣ́ͤ̌ͪ̀͞͞k̛̗̜̱̜͎̖̜̝͓̙͕̩̳͈̝̞̞̟̾̇̓̏͐̓̾̓ͦͬ͆͒̃ͫ̌͛̃͝ͅn̖̜͈͖̞̼͎͍̦͌̋ͯͫ̀̓ͪ̋̅͗̑̾̔ͧ͟͞i̡̨̬̫͇̪̯̯̍̓͒̑ͨ̎͛ͯͣ́͠ḯ̂̊ͫ͗͂ͤ̓̎ͣ͋̊̇̒҉̨̰͇̖̦̕͝͝i̎̿̂̅͒̈́̈̓̀ͤ͑̽ͫ̏͏͓̺̠͕͈̀͟k̷̢͕̣͓̼͔͍̭̭̙̺̰̰̦͈͍̥̩̎̀̍̓̉̽͗͐͗ͦ̊̃̍̀̚͘͘, ' + storedName;
}

myButton.onclick = function() {
	setUserName();
}
